In [ ]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import yaml # credentials:

:

In [2]:
# Récup des info de connection
with open('config.yaml', 'r') as file:
    config = yaml.safe_load(file)
#print(config)

cfg=config['PG']
# Connection à BDD
url = "{driver}://{user}:{password}@{host}/{database}".format(**cfg)
print('URL', url)
engine = create_engine(url)
engine

URL postgresql+psycopg2://postgres:greta2023@greta-p2-g2.westeurope.cloudapp.azure.com/netfloox

Engine(postgresql+psycopg2://postgres:***@greta-p2-g2.westeurope.cloudapp.azure.com/netfloox)

### Target / Features
- Target
  - title_ratings : averageRating
- Features
  - title_basics : genres
  - title_basics : runtimeMinutes

In [3]:
df_ratings = pd.read_sql("""
                         select tr.tconst, "averageRating" from title_ratings tr
                         left join final_title_basics ftb
                         on tr.tconst = ftb.tconst
                         """, engine)
df_ratings.head()

      tconst  averageRating
0  tt2091258            6.6
1  tt2091368            5.8
2  tt2091459            7.0
3  tt2091880            5.4
4  tt2093153            6.9

In [4]:
df_movies = pd.read_sql("""
                        select tconst, decade, "runtimeMinutes", genres from final_title_basics
                        """, engine)
df_movies.head()

       tconst  decade  runtimeMinutes                      genres
0  tt20912538     NaN             NaN                      Horror
1   tt2091256   201.0            89.0  Action,Adventure,Animation
2   tt2091258   201.0            76.0                    Thriller
3   tt2091260   201.0            90.0                      Comedy
4   tt2091261   193.0             NaN                       Drama

In [5]:
df_final = pd.merge(df_ratings, df_movies, how='inner', on='tconst')
df_final.head()

      tconst  averageRating  decade  runtimeMinutes    genres
0  tt2091258            6.6   201.0            76.0  Thriller
1  tt2091368            5.8   201.0           125.0     Drama
2  tt2091459            7.0   201.0            98.0     Drama
3  tt2091880            5.4   201.0            84.0     Drama
4  tt2093153            6.9   201.0            95.0     Drama

In [6]:
df_directors = pd.read_sql("""
                           select ftb.tconst, directors from title_crew tc
                           left join final_title_basics ftb
                           on ftb.tconst = tc.tconst
                           """, engine)
df_directors.head()

      tconst  directors
0  tt2091368  nm3626440
1  tt2094962  nm3852716
2  tt2094990  nm0117929
3  tt2100468       None
4  tt2102459  nm0047049

In [7]:
df_directors = df_directors.dropna(subset='tconst')

In [8]:
df_final = pd.merge(df_final, df_directors, on='tconst', how='inner')
df_final.head()

,tconst,averageRating,decade,runtimeMinutes,genres,directors
0,tt2091258,6.6,201.0,76.0,Thriller,"nm4211104,nm0930795"
1,tt2091368,5.8,201.0,125.0,Drama,nm3626440
2,tt2091459,7.0,201.0,98.0,Drama,nm3637259
3,tt2091880,5.4,201.0,84.0,Drama,nm1097974
4,tt2093153,6.9,201.0,95.0,Drama,nm0664607

In [11]:
df_final

,tconst,averageRating,decade,runtimeMinutes,genres,directors
0,tt2091258,6.6,201.0,76.0,Thriller,nm4211104
1,tt2091368,5.8,201.0,125.0,Drama,nm3626440
2,tt2091459,7.0,201.0,98.0,Drama,nm3637259
3,tt2091880,5.4,201.0,84.0,Drama,nm1097974
4,tt2093153,6.9,201.0,95.0,Drama,nm0664607
...,...,...,...,...,...,...
286801,tt2088865,7.2,201.0,65.0,"Biography,Documentary,Drama",nm2259264
286802,tt2089642,7.0,201.0,98.0,Drama,nm4731975
286803,tt2089653,5.7,201.0,77.0,"Drama,Horror,Thriller",nm2775992
286804,tt2089721,7.3,201.0,106.0,"Drama,Musical",nm2918988
286805,tt20899952,5.8,202.0,90.0,"Comedy,Romance",nm3488211

In [16]:
df_actors = pd.read_sql("""
                       select tconst, actors from tconst_actors
                       """, engine)
df_actors

             tconst                                   actors
0         tt0001409                                nm0594291
1         tt0000895  nm0366008,nm0601698,nm0125164,nm0163559
2         tt0001293                                nm0007221
3         tt0000956  nm0813603,nm0311375,nm0587097,nm0784407
4         tt0001344  nm0337033,nm1013170,nm0125164,nm0185803
...             ...                                      ...
4822499   tt3910900                                nm6676214
4822500   tt0883978            nm6117010,nm0097040,nm0000967
4822501   tt9377380                                nm5587584
4822502   tt3695594  nm1317850,nm0167594,nm0628585,nm0575114
4822503  tt16478860                      nm2525214,nm3127550

[4822504 rows x 2 columns]

In [19]:
df_final = pd.merge(df_actors, df_final, how='inner', on='tconst')

In [24]:
df_actress = pd.read_sql("""
                         select tconst, actress from tconst_actress
                         """, engine)

In [27]:
df_final = pd.merge(df_final, df_actress, how='inner', on='tconst')

In [31]:
df_final

,tconst,averageRating,decade,runtimeMinutes,genres,directors_name,actors,actress
0,tt0001630,6.2,191.0,45.0,None,Urban Gad,Hans Mierendorff,Agda Nilsson
1,tt0009062,6.1,191.0,48.0,Comedy,Ernst Lubitsch,Harry Liedtke,Agda Nilsson
2,tt1090247,7.0,193.0,NaN,Crime,Rolf Randolf,Hans Mierendorff,Zet Molas
3,tt0286687,6.2,192.0,NaN,"Action,Adventure,Drama",Joe May,Hans Mierendorff,Mia May
4,tt0014558,5.2,192.0,NaN,Drama,Joe May,Emil Jannings,Mia May
...,...,...,...,...,...,...,...,...
211617,tt9165740,6.2,202.0,101.0,Drama,Morgan Ingari,Michael Judson Berry,Molly Bernard
211618,tt3685554,6.3,201.0,91.0,"Drama,War",José Luis Rugeles,Carlos Clavijo,Carmenza González
211619,tt0064950,4.0,196.0,83.0,Horror,Joseph Adler,Ross Harris,Eugenie Wingate
211620,tt5823682,7.7,201.0,91.0,Thriller,Jon-Claire Lee,Asif Khan,Lucy Quill
211621,tt0357284,5.5,200.0,82.0,Documentary,Sigve Endresen,Jørn Christensen,Hilde Heltberg

In [ ]:
#penser a rajouter une ligne pour transformer les "None" en np.nan

In [33]:
df_final.to_csv('datasets/data_regression_sylvine.csv')